app/controllers/surveyforms_controller.rb

  def edit
    @surveyform = Surveyform.where(:id=>params[:id]).includes(:survey_sections).first
    @survey_locked=false
    #unfortunately, request.referrer does not seem to capture parameters. Need to add explicitly.
    #don't edit the format of a non template survey that has responses. could cause unpredictable results
    @surveyform.response_sets.where('test_data=?',true).map{|r| r.destroy}
    if !@surveyform.template && @surveyform.response_sets.count>0
      @survey_locked=true
      flash.now[:error] = "Reponses have already been collected for this survey, therefore any modifications you make will not be saved."
    end
    @title = "Edit "+ (@surveyform.template ? 'Template' : 'Survey')
    @surveyform.survey_sections.build if @surveyform.survey_sections.blank?
---
SELECT "survey_sections".* FROM "survey_sections" WHERE "survey_sections"."survey_id" IN (1) ORDER BY display_order
SELECT "response_sets".* FROM "response_sets" WHERE "response_sets"."survey_id" = 1 AND (test_data='t')
SELECT COUNT(*) FROM "response_sets" WHERE "response_sets"."survey_id" = 1
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = 1 LIMIT 1